# GetReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..GetReference Method
Subelement Class See Also
---
Obtains the reference to this subelement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Reference GetReference()
```

Visual Basic
---
```text
Public Function GetReference As Reference
```

Visual C++
---
```text
public:
Reference^ GetReference()
```

# ### Return Value
The reference to this subelement.
# See Also
Subelement Class
Autodesk.Revit.DB Namespace